Sunshine020215/WeGui_RGB/WeGui_RGB/GD32E230/Lcd_Port/gd32e230_lcd_other_port.c
#include "lcd_driver_config.h"
#include "lcd_wegui_config.h"

#if(LCD_PORT == _OTHER_PORT)

#include "gd32e230_lcd_other_port.h"
#include "lcd_driver.h"
#include "stdint.h"


#define PORT_SPIx       (0)
#define LCD_SPIx        SPI0
#define LCD_RCU_SPIx    RCU_SPI0


#if ((LCD_MODE == _FULL_BUFF_DYNA_UPDATE) || (LCD_MODE == _PAGE_BUFF_DYNA_UPDATE))
static uint32_t crc[((SCREEN_HIGH+7)/8)];//储存crc
/*--------------------------------------------------------------
  * 名称: LCD_Reset_crc()
  * 功能: 刷新一次crc值(动态刷新专用)
  * 说明: 用于强制刷新屏幕,防止动态刷新出现区域不刷新
----------------------------------------------------------------*/
void LCD_Reset_crc()
{
	uint16_t i=0;
	while(i < ((SCREEN_HIGH+7)/8))
	{
		crc[i]=0xff;
		i++;
	}
}

#define lcd_crc() do \
{\
		CRC_CTL |= (uint32_t)CRC_CTL_RST;\
		uint8_t *i = &lcd_driver.LCD_GRAM[ypage][0][0];\
		for(x=0;x<(SCREEN_WIDTH*LCD_COLOUR_BIT);x++)\
		{\
			REG8(CRC) = i[x];\
		}\
		i_crc = CRC_DATA;\
}while(0)

#endif

/*--------------------------------------------------------------
  * 名称: LCD_delay_ms(uint32_t ms)
  * 传入1: ms
  * 返回: 无
  * 功能: 软件延时
  * 说明: 非精准
----------------------------------------------------------------*/
void LCD_delay_ms(volatile uint32_t ms)
{
	//delay_ms(ms);
	
		volatile uint16_t i;
		while (ms--) 
		{
			i = 10000; //根据实际情况调整
			while (i--);
		}
}

/*--------------------------------------------------------------
  * 名称: LCD_Send_1Cmd(uint8_t dat)
  * 传入1: dat
  * 返回: 无
  * 功能: 向屏幕发送1个命令(DC=0时发1字节spi)
  * 说明: 
----------------------------------------------------------------*/
void LCD_Send_1Cmd(uint8_t dat)
{
	while(SPI_STAT(LCD_SPIx) & SPI_FLAG_TRANS);//while(spi_i2s_flag_get(TFT_SPIx,SPI_FLAG_TRANS));
	LCD_DC_Clr();
	LCD_CS_Clr();
	{
		SPI_DATA(LCD_SPIx) = dat;//spi_i2s_data_transmit(LCD_SPIx, dat);
	}
	while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET);//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
	while(SPI_STAT(LCD_SPIx) & SPI_FLAG_TRANS);//while(spi_i2s_flag_get(TFT_SPIx,SPI_FLAG_TRANS));
	LCD_CS_Set();
}
/*--------------------------------------------------------------
  * 名称: LCD_Send_1Dat(uint8_t dat)
  * 传入1: dat
  * 返回: 无
  * 功能: 向屏幕发送1个数据(DC=1时发1字节spi)
  * 说明: 
----------------------------------------------------------------*/
void LCD_Send_1Dat(uint8_t dat)
{
	while(SPI_STAT(LCD_SPIx) & SPI_FLAG_TRANS);//while(spi_i2s_flag_get(TFT_SPIx,SPI_FLAG_TRANS));
	LCD_DC_Set();
	LCD_CS_Clr();
	{
		SPI_DATA(LCD_SPIx) = dat;//spi_i2s_data_transmit(LCD_SPIx, dat);
	}
	while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET);//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
	while(SPI_STAT(LCD_SPIx) & SPI_FLAG_TRANS);//while(spi_i2s_flag_get(TFT_SPIx,SPI_FLAG_TRANS));
	LCD_CS_Set();
}

/*--------------------------------------------------------------
  * 名称: LCD_Send_nDat(uint8_t *p,uint16_t num)
  * 传入1: *p数组指针
  * 传入2: num发送数量
  * 返回: 无
  * 功能: 向屏幕发送num个数据
  * 说明: 
----------------------------------------------------------------*/
void LCD_Send_nDat(uint8_t *p,uint16_t num)
{
	uint8_t i=0;
	while(SPI_STAT(LCD_SPIx) & SPI_FLAG_TRANS);//while(spi_i2s_flag_get(TFT_SPIx,SPI_FLAG_TRANS));
	LCD_DC_Set();
	LCD_CS_Clr();
	while(num>i)	  
	{
		while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET);//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
		SPI_DATA(LCD_SPIx) = p[i++];//spi_i2s_data_transmit(LCD_SPIx, p[i++]);
	}
	while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET);//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
	while(SPI_STAT(LCD_SPIx) & SPI_FLAG_TRANS);//while(spi_i2s_flag_get(TFT_SPIx,SPI_FLAG_TRANS));
	LCD_CS_Set();
}



//-------------------------------------------OLED屏幕驱动接口----------------------------------------------
#if defined (LCD_USE_NORMAL_OLED) || defined (LCD_USE_GRAY_OLED)



/*--------------------------------------------------------------
  * 名称: LCD_Port_Init()
  * 传入: 无
  * 返回: 无
  * 功能: 屏幕接口初始化
  * 说明: 
----------------------------------------------------------------*/
void LCD_Port_Init(void)
{
	//OELD SPI SCL默认常高,第二个跳变数据沿有效
	spi_parameter_struct spi_init_struct=
	{
		.trans_mode           = SPI_TRANSMODE_FULLDUPLEX,
		.device_mode          = SPI_MASTER,
		.frame_size           = SPI_FRAMESIZE_8BIT,
		.clock_polarity_phase = SPI_CK_PL_HIGH_PH_2EDGE,
		.nss                  = SPI_NSS_SOFT,
		.prescale             = SPI_PSC_x,
		.endian               = SPI_ENDIAN_MSB,
	};
	
	LCD_SCL_IO_Init();
	LCD_SDA_IO_Init();
	LCD_RES_IO_Init();
	LCD_DC_IO_Init();
	LCD_CS_IO_Init();
	LCD_BL_IO_Init();
	
	spi_i2s_deinit(LCD_SPIx);
	
	rcu_periph_clock_enable(LCD_RCU_SPIx);
	spi_init(LCD_SPIx, &spi_init_struct);
	spi_enable(LCD_SPIx);
	
	#if ((LCD_MODE == _FULL_BUFF_DYNA_UPDATE) || (LCD_MODE ==_PAGE_BUFF_DYNA_UPDATE))
	rcu_periph_clock_enable(RCU_CRC);//动态刷新CRC校验用
	#endif
	
	LCD_RES_Clr();
	{
		volatile unsigned int i=10000;
		while(i--);
	}
	LCD_RES_Set();
}


/*--------------------------------------------------------------
  * 名称: LCD_Send_nCmd(uint8_t *p,uint16_t num)
  * 传入1: *p数组指针
  * 传入2: num发送数量
  * 返回: 无
  * 功能: 向屏幕发送num个命令
  * 说明: 
----------------------------------------------------------------*/
void LCD_Send_nCmd(uint8_t *p,uint16_t num)
{
	uint8_t i=0;
	while(SPI_STAT(LCD_SPIx) & SPI_FLAG_TRANS);//while(spi_i2s_flag_get(TFT_SPIx,SPI_FLAG_TRANS));
	LCD_DC_Clr();
	LCD_CS_Clr();
	while(num>i)	  
	{
		while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET);//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
		SPI_DATA(LCD_SPIx) = p[i++];//spi_i2s_data_transmit(LCD_SPIx, p[i++]);
	}
	while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET);//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
	while(SPI_STAT(LCD_SPIx) & SPI_FLAG_TRANS);//while(spi_i2s_flag_get(TFT_SPIx,SPI_FLAG_TRANS));
	LCD_CS_Set();
}







//-------------------------------------------RGB屏幕驱动接口----------------------------------------------
#elif defined (LCD_USE_RGB565)
void LCD_Port_Init(void)
{
	//TFT SPI SCL默认常低,第一个跳变数据沿有效
	spi_parameter_struct spi_init_struct=
	{
		.trans_mode           = SPI_TRANSMODE_FULLDUPLEX,
		.device_mode          = SPI_MASTER,
		.frame_size           = SPI_FRAMESIZE_8BIT,
		.clock_polarity_phase = SPI_CK_PL_LOW_PH_1EDGE,
		.nss                  = SPI_NSS_SOFT,
		.prescale             = SPI_PSC_x,
		.endian               = SPI_ENDIAN_MSB,
	};
	
	LCD_SCL_IO_Init();
	LCD_SDA_IO_Init();
	LCD_RES_IO_Init();
	LCD_DC_IO_Init();
	LCD_CS_IO_Init();
	LCD_BL_IO_Init();
	
