Sunshine020215/WeGui_RGB/WeGui_RGB/GD32E230/Lcd_Port/gd32e230_lcd_other_port.c
	lcd_driver.lcd_refresh_ypage += GRAM_YPAGE_NUM;
	if(lcd_driver.lcd_refresh_ypage >= ((SCREEN_HIGH+7)/8))
	{
		lcd_driver.lcd_refresh_ypage = 0;
	}
	return lcd_driver.lcd_refresh_ypage;
}

//---------方式4:页缓存动态刷新----------
#elif (LCD_MODE == _PAGE_BUFF_DYNA_UPDATE)
uint8_t LCD_Refresh(void)
{
	//每page做"sum+mini_crc组合"校验,若校验码没变,则不刷新该page
	unsigned char ypage,x,y,i,ycount;
	for(ypage=0;ypage<GRAM_YPAGE_NUM;ypage++)
	{
		uint32_t i_crc;
		//-----方式1:CRC算法校验-----
		lcd_crc();//宏定义
		//---------------------------


		if(crc[ypage] != i_crc)
		{
			ycount = 8* ypage;
#if defined(GRAY_DRIVER_0DEG)
			//----扫描方向1(不旋转)---
			LCD_Set_Addr(0,lcd_driver.lcd_refresh_ypage*8+ycount,(SCREEN_WIDTH/2-1),(SCREEN_HIGH-1));
			LCD_DC_Set();
			LCD_CS_Clr();
			
			for(y=0;y<8;y++)
			{
				uint8_t mask;
				ycount++;
				if((ycount >= SCREEN_HIGH)||(y>=(GRAM_YPAGE_NUM*8))){break;}

				mask=0x01<<(y%8);
				for(x=0;x<SCREEN_WIDTH;)
				{
					//----第一个点----
					i = 0x00;
					if(lcd_driver.LCD_GRAM[ypage][x][0]&mask)
					{
						i = GRAY_COLOUR<<4;
					}
					//----第二个点----
					x++;
					if((lcd_driver.LCD_GRAM[ypage][x][0]&mask)&&(x<SCREEN_WIDTH))
					{
						i |= GRAY_COLOUR;
					}
					x++;
					while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET);//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
					SPI_DATA(LCD_SPIx) = i;//spi_i2s_data_transmit(LCD_SPIx, p[i++]);
				}
			}

#elif defined(GRAY_DRIVER_90DEG)
			//---扫描方向2(90度旋转)----
			LCD_Set_Addr(lcd_driver.lcd_refresh_ypage*4 + ycount/2,0,((SCREEN_HIGH+1)/2-1),(SCREEN_WIDTH-1));
			LCD_DC_Set();
			LCD_CS_Clr();
			for(y=0;y<8;)
			{
				if(++ycount >= SCREEN_HIGH){break;}
				for(x=0;x<SCREEN_WIDTH;x++)
				{
					//(4位一个点)
					//----第一个点----
					i = 0x00;
					//j = y + lcd_driver.lcd_refresh_ypage*8;
					//if((j+1)<=SCREEN_HIGH)
					{
						if(lcd_driver.LCD_GRAM[ypage][x][0]&(0x01<<y))
						{
							i = GRAY_COLOUR<<4;
						}
						//----第二个点----
						//if((j+1)<SCREEN_HIGH)
						{
							if(lcd_driver.LCD_GRAM[ypage][x][0]&(0x01<<(y+1)))
							{
								i |= GRAY_COLOUR;
							}
						}
					}
					while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET);//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
					SPI_DATA(LCD_SPIx) = i;//spi_i2s_data_transmit(LCD_SPIx, p[i++]);
				}
				y+=2;
			}
#endif
			crc[ypage] = i_crc;
			while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET);//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
			while(SPI_STAT(LCD_SPIx) & SPI_FLAG_TRANS);//while(spi_i2s_flag_get(TFT_SPIx,SPI_FLAG_TRANS));
			LCD_CS_Set();
		}
	}
	
	lcd_driver.lcd_refresh_ypage += GRAM_YPAGE_NUM;
	if(lcd_driver.lcd_refresh_ypage >= ((SCREEN_HIGH+7)/8))
	{
		lcd_driver.lcd_refresh_ypage = 0;
	}
	return lcd_driver.lcd_refresh_ypage;
}
#endif



//----------------------------RGB565屏幕刷屏接口-------------------------------------
#elif defined (LCD_USE_RGB565)



#if (LCD_MODE == _FULL_BUFF_FULL_UPDATE)
//---------方式1:全缓存全屏刷----------
uint8_t LCD_Refresh(void)
{
	uint16_t x,y;
	LCD_Set_Addr(0,0,SCREEN_WIDTH-1,SCREEN_HIGH-1);
	
	Set_SPI_DataSize_16b();
	LCD_DC_Set();
	LCD_CS_Clr();
	
	for(y=0;y<SCREEN_HIGH;y++)
	{
		uint8_t ypage=y/8;
		uint8_t mask=0x01<<(y%8);
		uint8_t *gram=&lcd_driver.LCD_GRAM[ypage][0][0];
		for(x=0;x<SCREEN_WIDTH;x++)
		{
			uint8_t c=0;
			#if (LCD_COLOUR_BIT>=1)//---1位色---
				if(*gram++&mask){c+=1;}
			#endif
			#if (LCD_COLOUR_BIT>=2)//---2位色---
				if(*gram++&mask){c+=2;}
			#endif
			#if (LCD_COLOUR_BIT>=3)//---3位色---
				if(*gram++&mask){c+=4;}
			#endif
			while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET){}//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
			SPI_DATA(LCD_SPIx) = lcd_driver.colour[c];//spi_i2s_data_transmit(LCD_SPIx, lcd_driver.colour[c]);
		}
	}
	//while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET);//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
	while(SPI_STAT(LCD_SPIx) & SPI_FLAG_TRANS);//while(spi_i2s_flag_get(TFT_SPIx,SPI_FLAG_TRANS));
	LCD_CS_Set();
	Set_SPI_DataSize_8b();
	return 0;
}

#elif (LCD_MODE == _FULL_BUFF_DYNA_UPDATE)
//---------方式2:全缓存动态刷----------
uint8_t LCD_Refresh(void)
{
	//每page做校验,若校验码没变,则不刷新该page
	unsigned char ypage,ycount;
	uint16_t x;
	for(ypage=0;ypage<GRAM_YPAGE_NUM;ypage++)
	{
		uint32_t i_crc;
		//-----方式1:CRC算法校验-----
		lcd_crc();//宏定义
		//---------------------------

		if(crc[ypage] != i_crc)
		{
			uint8_t y=0;
			LCD_Set_Addr(0,ypage*8,SCREEN_WIDTH-1,SCREEN_HIGH-1);
			LCD_DC_Set();
			LCD_CS_Clr();
			Set_SPI_DataSize_16b();
			ycount = 8* ypage;
			for(y=0;y<8;y++)
			{
				uint8_t x,mask;
				if(++ycount >= SCREEN_HIGH){break;}
				mask=0x01<<(y%8);
				uint8_t *gram=&lcd_driver.LCD_GRAM[ypage][0][0];
				for(x=0;x<SCREEN_WIDTH;x++)
				{
					uint8_t c=0;
					#if (LCD_COLOUR_BIT>=1)//---1位色---
						if(*gram++&mask){c+=1;}
					#endif
					#if (LCD_COLOUR_BIT>=2)//---2位色---
						if(*gram++&mask){c+=2;}
					#endif
					#if (LCD_COLOUR_BIT>=3)//---3位色---
						if(*gram++&mask){c+=4;}
					#endif
					while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET){}//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
					SPI_DATA(LCD_SPIx) = lcd_driver.colour[c];//spi_i2s_data_transmit(LCD_SPIx, lcd_driver.colour[c]);
				}
			}
			//while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET);//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
			while(SPI_STAT(LCD_SPIx) & SPI_FLAG_TRANS);//while(spi_i2s_flag_get(TFT_SPIx,SPI_FLAG_TRANS));
			LCD_CS_Set();
			Set_SPI_DataSize_8b();
			crc[ypage] = i_crc;
		}
	}
	LCD_CS_Set();
	Set_SPI_DataSize_8b();
	return 0;
}
#elif (LCD_MODE == _PAGE_BUFF_FULL_UPDATE)

//---------方式3:页缓存全屏刷新----------
uint8_t LCD_Refresh(void)
{
	uint16_t x,y;
	LCD_Set_Addr(0,lcd_driver.lcd_refresh_ypage*8,SCREEN_WIDTH-1,SCREEN_HIGH-1);
	
	Set_SPI_DataSize_16b();
	LCD_DC_Set();
	LCD_CS_Clr();
	
	for(y=0;(y+lcd_driver.lcd_refresh_ypage*8)<SCREEN_HIGH;)
	{
		uint8_t mask=0x01<<(y%8);
		uint8_t *gram=&lcd_driver.LCD_GRAM[y/8][0][0];
		for(x=0;x<SCREEN_WIDTH;x++)
		{
			uint8_t c=0;
			#if (LCD_COLOUR_BIT>=1)//---1位色---
				if(*gram++&mask){c+=1;}
			#endif
			#if (LCD_COLOUR_BIT>=2)//---2位色---
				if(*gram++&mask){c+=2;}
			#endif
			#if (LCD_COLOUR_BIT>=3)//---3位色---
				if(*gram++&mask){c+=4;}
			#endif
			while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET);//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
			SPI_DATA(LCD_SPIx) = lcd_driver.colour[c];//spi_i2s_data_transmit(LCD_SPIx, lcd_driver.colour[c]);
		}
		y++;
		if(y>=(GRAM_YPAGE_NUM*8))
		{
			break;
		}
	}
	//while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET);//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
	while(SPI_STAT(LCD_SPIx) & SPI_FLAG_TRANS);//while(spi_i2s_flag_get(TFT_SPIx,SPI_FLAG_TRANS));
	LCD_CS_Set();
	Set_SPI_DataSize_8b();
	
