Sunshine020215/WeGui_RGB/WeGui_RGB/GD32E230/Lcd_Port/gd32e230_lcd_other_port.c
	lcd_driver.lcd_refresh_ypage += GRAM_YPAGE_NUM;
	if(lcd_driver.lcd_refresh_ypage >= ((SCREEN_HIGH+7)/8))
	{
		lcd_driver.lcd_refresh_ypage = 0;
	}
	return lcd_driver.lcd_refresh_ypage;
}


#elif (LCD_MODE == _PAGE_BUFF_DYNA_UPDATE)
//---------方式4:页缓存动态刷新----------
uint8_t LCD_Refresh(void)
{
	//每page做校验,若校验码没变,则不刷新该page
	uint8_t ypage,ycount;
	uint16_t x;
	for(ypage=0;ypage<GRAM_YPAGE_NUM;ypage++)
	{
		uint32_t i_crc;
		if((lcd_driver.lcd_refresh_ypage + ypage)>=((SCREEN_HIGH+7)/8))
		{
			break;
		}
		//-----方式1:CRC算法校验-----
		lcd_crc();//宏定义
		//---------------------------
		if(crc[lcd_driver.lcd_refresh_ypage + ypage] != i_crc)
		{
			uint8_t y=0;
			
			LCD_Set_Addr(0,(lcd_driver.lcd_refresh_ypage+ypage)*8,SCREEN_WIDTH-1,SCREEN_HIGH-1);
			LCD_DC_Set();
			LCD_CS_Clr();
			Set_SPI_DataSize_16b();
			
			ycount = 8* (ypage + lcd_driver.lcd_refresh_ypage);
			for(y=0;y<8;y++)
			{
				uint8_t mask;
				if(++ycount >= SCREEN_HIGH)
				{
					break;
				}
				mask=0x01<<(y%8);
				uint8_t *gram=&lcd_driver.LCD_GRAM[ypage][0][0];
				for(x=0;x<SCREEN_WIDTH;x++)
				{
					uint8_t c=0;
					#if (LCD_COLOUR_BIT>=1)//---1位色---
						if(*gram++&mask){c+=1;}
					#endif
					#if (LCD_COLOUR_BIT>=2)//---2位色---
						if(*gram++&mask){c+=2;}
					#endif
					#if (LCD_COLOUR_BIT>=3)//---3位色---
						if(*gram++&mask){c+=4;}
					#endif
					while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET);//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
					SPI_DATA(LCD_SPIx) = lcd_driver.colour[c];//spi_i2s_data_transmit(LCD_SPIx, lcd_driver.colour[c]);
				}
			}
			crc[lcd_driver.lcd_refresh_ypage + ypage] = i_crc;
			//while((SPI_STAT(LCD_SPIx) & SPI_FLAG_TBE)==RESET);//while(spi_i2s_flag_get(LCD_SPIx,SPI_FLAG_TBE)==RESET);
			while(SPI_STAT(LCD_SPIx) & SPI_FLAG_TRANS);//while(spi_i2s_flag_get(TFT_SPIx,SPI_FLAG_TRANS));
			LCD_CS_Set();
			Set_SPI_DataSize_8b();
		}
	}
	LCD_CS_Set();
	Set_SPI_DataSize_8b();
	
	lcd_driver.lcd_refresh_ypage += GRAM_YPAGE_NUM;
	if(lcd_driver.lcd_refresh_ypage >= ((SCREEN_HIGH+7)/8))
	{
		lcd_driver.lcd_refresh_ypage = 0;
	}
	return lcd_driver.lcd_refresh_ypage;
}
#endif



#endif
#endif
